"""
4. Вывести на консоль своё имя, нарисованное 'звёздочками'. Для выполнения этого задания надо использовать не только
символы звёздочки и пробела, но и ESCAPE символы: \n и \t

*       *         *         *       * *********
**      *        * *        **     ** *
* *     *       *   *       * *   * * *
*  *    *      *     *      *  * *  * *******
*   *   *     *       *     *   *   * *
*    *  *    ***********    *       * *
*     * *   *           *   *       * *
*      **  *             *  *       * *
*       * *               * *       * **********


********    *  *       *          *
*       *      **     **         * *
*       *   *  * *   * *        *   *
*       *   *  *   *   *       *     *
*       *   *  *       *      *********
*       *   *  *       *     *         *
*       *   *  *       *    *           *
********    *  *       *   *             *
"""

print("\t********    *  *       *          *\n\t*       *      **     **         * *")
print("\t*       *   *  * *   * *        *   *\n\t*       *   *  *   *   *       *     *")
print("\t*       *   *  *       *      *********\n\t*       *   *  *       *     *         *")
print("\t*       *   *  *       *    *           *\n\t********    *  *       *   *             *")
